
Search




7
Welcome to Mattermost
Let's get up and running.

On Boarding videoWatch overview
Take a tour of channels
Explore workflows with your first Playbook
Invite team members to the workspace
Download the Desktop and Mobile Apps
Complete your profile
Visit the System Console to configure your workspace
Learn more about Enterprise-level high-security features
No thanks, I’ll figure it out myself

Find channel
Threads

CHANNELS
Off-Topic
PushTest
Town Square

DIRECT MESSAGES

regina
ricardo.altweck
rudi2test
josefa
leo
rudi (you)
feedbackbot

Invite Members

Online



Add a channel header


At 4:34 PM Wednesday, March 22, regina wrote, Mein Google: ina7360@gmail.com
November 23, 2022
	
regina
7:21 PM
und zum Thema Key bin ich mir immer noch nicht sicher, aber ich glaube mittlerweile, dass der von google kommt und erst bei Releas hinzugefügt wird

	
rudi
Update your status
7:26 PM
jap, einladung ist da, danke :thumbsup: 
und das klingt so als würde die OTH app auch das google play signing benutzt, das wäre eh das was wir auch vorhatten :slightly_smiling_face: 
bin mir auch garnicht sicher ob/welche anderen lösungen es dafür gäbe, aber so ists wohl eh am besten :grin: 

January 17
	
rudi
Update your status
5:37 PM
Sorry übrigens falls die Nachricht in der Gruppe so gewirkt hat, als hätten wir keinen Bock dich in den aktuellen Stand der Dinge einzubinden, so war's wirklich ned gemeint :sweat_smile:
Sind einfach nur eklige Probleme mit Apple die wir derzeit haben und der Leo kann meistens auch nicht mehr machen als googlen, deswegen hocken wir ziemlich viel vor dem Mac und kämpfen ewig mit Kleinigkeiten... Dachte das musst du dir nicht auch unbedingt geben wenn du was besseres zu tun hast :see_no_evil: 

	
regina
5:40 PM
nein nein, alles gut, ich will auch nur, dass ihr nicht das Gefühl habt ihr seid allen :smile: Aber wenn ihr sagt, dass es nicht Sinn macht gemeinsam zu suchen, dann ist das für mich völlig in Ordnung :smile: 

	
rudi
Update your status
5:50 PM
Ok alles klar :grin: 

January 24
	
rudi
Update your status
8:20 PM
Hello nochmal :wave:
Sorry dass das Update erst so spät kommt, aber ich war selber nicht dabei letzte Woche :see_no_evil:
Aber zusammen mit Daniel Kreiter, den der Leo zur Hilfe organisiert hat, haben Ricardo und Seffi dann spät abends noch die App endlich auf dem Apple Gerät zum laufen gebracht :partying_face:
Da wir jetzt aber alle mit Prüfungen beschäftigt sein werden, haben wir gesagt wir treffen uns erst wieder wenn wir damit durch sind. Ich werd fast eine Woche vor den anderen beiden fertig, heißt ich hab da Zeit mir im CircleCI im Detail anzuschauen und kann euch dann hoffentlich nach den Prüfungen erzählen, wie das funktioniert und/oder was es für uns dabei überhaupt noch zu tun gibt, weil von Mattermost selbst dafür ein schon recht ausführliches Skript vorhanden ist. 
Weiß jetzt nicht, ob du während den Semesterferien dann für ein Treffen rein schauen magst oder nicht. Ich denke wir werden auf jeden Fall wieder zum Leo schauen, sobald die Prüfungen vorbei sind. Aber wenn du ein bisschen die freie Zeit genießen willst, können wir dich auch gerne sobald das neue Semester gestartet hat wieder auf den neusten Stand bringen :slightly_smiling_face: 
Wir schreiben dann aber sowieso hier nochmal rein, bevor wir das nächste Treffen machen, dann kannst du ja spontan entscheiden :slightly_smiling_face: 

Und auch dir schonmal viel Glück bei den Prüfungen, falls wir uns vorher nicht mehr über den Weg laufen sollten :grin: 

March 15
	
rudi
Update your status
2:36 PM
https://help.radio.co/en/articles/6232140-how-to-get-your-google-play-json-key

How to Get Your Google Play JSON Key | Radio.co Help Center
Generate your Google Play JSON within the Google Play Developer Console.

How to Get Your Google Play JSON Key | Radio.co Help Center
	
regina
2:47 PM
pc-api-6860016751147692494-701-05101c257b4d.json
JSON2KB
	
rudi
Update your status
9:22 PM
sorry ich hab bis jetzt noch am deployment von android rumgespielt, aber hab das json file das du mir geschickt hast noch nicht ausprobieren können, weil irgendwo noch etwas mit den pfaden nicht stimmt :see_no_evil: ich meld mich am freitag nochmal, da arbeite ich wieder dran :slightly_smiling_face: 

	
regina
10:37 PM
Kein Problem :slightly_smiling_face:
Passt :+1:

Thursday
	
rudi
Update your status
8:43 AM
hat mich gestern abend doch nicht mehr in ruhe gelassen, hab noch weiter gebastelt :joy: konnte die app noch nicht hochladen, weil der aller erste upload anscheinend manuell passieren muss, aber ich glaub das json file von dir sollte schon funktionieren (nehme mal an sonst hätte ich irgendeinen unauthorized/forbidden fehler oder ähnliches beim versuch bekommen) :thumbsup: 

	
regina
8:55 AM
Super danke :smile:
Dann passt das schonmal ^^ 
Danke für deine Arbeit:)

	
rudi
Update your status
10:13 AM
nichts zu danken, ist mein job :grinning_face_with_one_large_and_one_small_eye: 

	
regina
8:21 PM
:smile: 

im OTH App Team würden wir noch einen Scrum Master suchen, darauf hast du wahrscheinlich keine Lust noch zusätzlich oder? Betreut wird von Herrn Heckner, das heißt ich denke es wird weniger stressig als im Vergleich zu Mm ; )

	
rudi
Update your status
11:13 PM
wann würde das denn starten? :sweat_smile: bin mir nicht ganz sicher wie ich das im moment zeitlich hinbekommen würde, solang das mattermost HSP noch läuft :sweat_smile: 

	
regina
11:31 PM
Joa schon in den nächsten zwei Wochen:/

Friday
	
rudi
Update your status
9:50 AM
Hast du vielleicht eine ganz grobe Abschätzung, wie viel Zeit da pro Woche dafür draufgehen würde? :see_no_evil:  Lust hätte ich nämlich eigentlich schon sehr wenn ich genauer drüber nachdenke :grin: 

	
regina
10:54 AM
Also jetzt am Anfang schon mehr bis man drinnen ist. Denke ca 5h bis man Mal alles gelesen hat und danach würde ich sagen 3-4 h in der Woche vielleicht auch etwas weniger. 
Derzeit sind noch Scrum Master und Backend Entwicklung gesucht :wink:
Scrum Master ist hald viel Orga und man hat min zwei Meetings pro Woche mit dem Team und Product Owner.

	
rudi
Update your status
10:56 AM
Ich weiß nicht wie eilig ihr es habt, oder ob es noch andere "Bewerber" gibt, aber können wir da vielleicht am Mittwoch nach unserem nächsten HSP meeting nochmal drüber reden? :slightly_smiling_face: oder wird das zu spät

aber 3-4h pro woche sollte ich auf jeden fall unterbringen denke ich 

	
regina
11:00 AM
Ja können wir gerne machen. 
 Herr Heckner hat gerade einen Kick Off Termin rum geschickt für Freitag 24.03. 9-10 
Bis dahin kannst du ja noch überlegen und wir sprechen vorher :slightly_smiling_face:

	
rudi
Update your status
11:01 AM
perfekt, dann sprechen wir einfach am mittwoch nochmal :slightly_smiling_face: danke dir auf jeden fall für das angebot schonmal :grin: 

Today
	
regina
3:56 PM
neu_pc-api-6860016751147692494-701-b8a93ca39295.json
JSON2KB
	
regina
4:05 PM
google-services.json
JSON1003B
AAAAisWVX3A:APA91bGwimeDxstqRC1esVTfZ9N9iPIrIZ23Ls1dPBpMsyFi3FNUu6mLX7rO4i4rfJ1xzLbeMgKvPuKXl8fZ2GjU_8U8hJBA8qdRCdwEgxkdJJnfv3Bwc4radKorP2fOExqLhbtF92XD

	
regina
4:31 PM
Markus.heckner@othr.de

Oth-app@othr.de

Mein Google: ina7360@gmail.com

Write to regina


Keine ausgewählt


google-services.json
ReginaShared In ~Regina

google-services.json - JSON
{
  "project_info": {
    "project_number": "596020387696",
    "project_id": "oth-mattermost",
    "storage_bucket": "oth-mattermost.appspot.com"
  },
  "client": [
    {
      "client_info": {
        "mobilesdk_app_id": "1:596020387696:android:ed736dcefd4f72356679b5",
        "android_client_info": {
          "package_name": "de.othregensburg.mattermost"
        }
      },
      "oauth_client": [
        {
          "client_id": "596020387696-cdf2vaal3j6ddg81scql11osmh6unnn8.apps.googleusercontent.com",
          "client_type": 3
        }
      ],
      "api_key": [
        {
          "current_key": "AIzaSyACkyMOXe76OMLZSATq5o2lMZ9_hcFhM9k"
        }
      ],
      "services": {
        "appinvite_service": {
          "other_platform_oauth_client": [
            {
              "client_id": "596020387696-cdf2vaal3j6ddg81scql11osmh6unnn8.apps.googleusercontent.com",
              "client_type": 3
            }
          ]
        }
      }
    }
  ],
  "configuration_version": "1"
}
